layer {
  name: "data"
  type: "CPMHandData"
  top: "data"
  top: "label"
  data_param {
    source: "/home/maxiao/Works/HandPose/data/dataset_3/lmdb"
    batch_size: 12
    backend: LMDB
  }
  cpm_hand_transform_param {
    stride: 8
    crop_size_x: 256
    crop_size_y: 256
    num_parts: 62
    np_in_lmdb: 21
     max_rotate_degree: 40
    scale_prob: 1
    scale_min: 0.5
    scale_max: 1.1
    hand_padding: 1.2
    center_perterb_max: 15
    do_aug: true
  }
}
layer {
  name: "label_slice"
  type: "Slice"
  bottom: "label"
  top: "label_vec"
  top: "label_heat"
  slice_param {
    slice_point: 40
    axis: 1
  }
}
layer {
  name: "image"
  type: "Slice"
  bottom: "data"
  top: "image"
  top: "center_map"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
layer {
  name: "silence2"
  type: "Silence"
  bottom: "center_map"
}

layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "image"
  top: "conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1_stage1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1_stage1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1_stage1"
  top: "conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2_stage1"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2_stage1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2_stage1"
  top: "conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "conv3_4"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_4"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_4"
  type: "ReLU"
  bottom: "conv3_4"
  top: "conv3_4"
}
layer {
  name: "pool3_stage1"
  type: "Pooling"
  bottom: "conv3_4"
  top: "pool3_stage1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3_stage1"
  top: "conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3_HandCPM"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3_HandCPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_3_HandCPM"
  type: "ReLU"
  bottom: "conv4_3_HandCPM"
  top: "conv4_3_HandCPM"
}
layer {
  name: "conv4_4_HandCPM"
  type: "Convolution"
  bottom: "conv4_3_HandCPM"
  top: "conv4_4_HandCPM"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_4_HandCPM"
  type: "ReLU"
  bottom: "conv4_4_HandCPM"
  top: "conv4_4_HandCPM"
}
layer {
  name: "conv5_1_HandCPM_L1"
  type: "Convolution"
  bottom: "conv4_4_HandCPM"
  top: "conv5_1_HandCPM_L1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_1_HandCPM_L1"
  type: "ReLU"
  bottom: "conv5_1_HandCPM_L1"
  top: "conv5_1_HandCPM_L1"
}
layer {
  name: "conv5_1_HandCPM_L2"
  type: "Convolution"
  bottom: "conv4_4_HandCPM"
  top: "conv5_1_HandCPM_L2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_1_HandCPM_L2"
  type: "ReLU"
  bottom: "conv5_1_HandCPM_L2"
  top: "conv5_1_HandCPM_L2"
}
layer {
  name: "conv5_2_HandCPM_L1"
  type: "Convolution"
  bottom: "conv5_1_HandCPM_L1"
  top: "conv5_2_HandCPM_L1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_2_HandCPM_L1"
  type: "ReLU"
  bottom: "conv5_2_HandCPM_L1"
  top: "conv5_2_HandCPM_L1"
}
layer {
  name: "conv5_2_HandCPM_L2"
  type: "Convolution"
  bottom: "conv5_1_HandCPM_L2"
  top: "conv5_2_HandCPM_L2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_2_HandCPM_L2"
  type: "ReLU"
  bottom: "conv5_2_HandCPM_L2"
  top: "conv5_2_HandCPM_L2"
}
layer {
  name: "conv5_3_HandCPM_L1"
  type: "Convolution"
  bottom: "conv5_2_HandCPM_L1"
  top: "conv5_3_HandCPM_L1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_3_HandCPM_L1"
  type: "ReLU"
  bottom: "conv5_3_HandCPM_L1"
  top: "conv5_3_HandCPM_L1"
}
layer {
  name: "conv5_3_HandCPM_L2"
  type: "Convolution"
  bottom: "conv5_2_HandCPM_L2"
  top: "conv5_3_HandCPM_L2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_3_HandCPM_L2"
  type: "ReLU"
  bottom: "conv5_3_HandCPM_L2"
  top: "conv5_3_HandCPM_L2"
}
layer {
  name: "conv5_4_HandCPM_L1"
  type: "Convolution"
  bottom: "conv5_3_HandCPM_L1"
  top: "conv5_4_HandCPM_L1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_4_HandCPM_L1"
  type: "ReLU"
  bottom: "conv5_4_HandCPM_L1"
  top: "conv5_4_HandCPM_L1"
}
layer {
  name: "conv5_4_HandCPM_L2"
  type: "Convolution"
  bottom: "conv5_3_HandCPM_L2"
  top: "conv5_4_HandCPM_L2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_4_HandCPM_L2"
  type: "ReLU"
  bottom: "conv5_4_HandCPM_L2"
  top: "conv5_4_HandCPM_L2"
}
layer {
  name: "conv5_5_HandCPM_L1"
  type: "Convolution"
  bottom: "conv5_4_HandCPM_L1"
  top: "conv5_5_HandCPM_L1"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 40
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "conv5_5_HandCPM_L2"
  type: "Convolution"
  bottom: "conv5_4_HandCPM_L2"
  top: "conv5_5_HandCPM_L2"
  param {
    lr_mult: 1.0
    decay_mult: 1
  }
  param {
    lr_mult: 2.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 22
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss_stage1_L1"
  type: "EuclideanLoss"
  bottom: "conv5_5_HandCPM_L1"
  bottom: "label_vec"
  top: "loss_stage1_L1"
  loss_weight: 1
}
layer {
  name: "loss_stage1_L2"
  type: "EuclideanLoss"
  bottom: "conv5_5_HandCPM_L2"
  bottom: "label_heat"
  top: "loss_stage1_L2"
  loss_weight: 1
}
layer {
  name: "concat_stage2"
  type: "Concat"
  bottom: "conv5_5_HandCPM_L1"
  bottom: "conv5_5_HandCPM_L2"
  bottom: "conv4_4_HandCPM"
  top: "concat_stage2"
  concat_param {
    axis: 1
  }
}
layer {
  name: "HandMconv1_stage2_L1"
  type: "Convolution"
  bottom: "concat_stage2"
  top: "HandMconv1_stage2_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu1_stage2_L1"
  type: "ReLU"
  bottom: "HandMconv1_stage2_L1"
  top: "HandMconv1_stage2_L1"
}
layer {
  name: "HandMconv1_stage2_L2"
  type: "Convolution"
  bottom: "concat_stage2"
  top: "HandMconv1_stage2_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu1_stage2_L2"
  type: "ReLU"
  bottom: "HandMconv1_stage2_L2"
  top: "HandMconv1_stage2_L2"
}
layer {
  name: "HandMconv2_stage2_L1"
  type: "Convolution"
  bottom: "HandMconv1_stage2_L1"
  top: "HandMconv2_stage2_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu2_stage2_L1"
  type: "ReLU"
  bottom: "HandMconv2_stage2_L1"
  top: "HandMconv2_stage2_L1"
}
layer {
  name: "HandMconv2_stage2_L2"
  type: "Convolution"
  bottom: "HandMconv1_stage2_L2"
  top: "HandMconv2_stage2_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu2_stage2_L2"
  type: "ReLU"
  bottom: "HandMconv2_stage2_L2"
  top: "HandMconv2_stage2_L2"
}
layer {
  name: "HandMconv3_stage2_L1"
  type: "Convolution"
  bottom: "HandMconv2_stage2_L1"
  top: "HandMconv3_stage2_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu3_stage2_L1"
  type: "ReLU"
  bottom: "HandMconv3_stage2_L1"
  top: "HandMconv3_stage2_L1"
}
layer {
  name: "HandMconv3_stage2_L2"
  type: "Convolution"
  bottom: "HandMconv2_stage2_L2"
  top: "HandMconv3_stage2_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu3_stage2_L2"
  type: "ReLU"
  bottom: "HandMconv3_stage2_L2"
  top: "HandMconv3_stage2_L2"
}
layer {
  name: "HandMconv4_stage2_L1"
  type: "Convolution"
  bottom: "HandMconv3_stage2_L1"
  top: "HandMconv4_stage2_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu4_stage2_L1"
  type: "ReLU"
  bottom: "HandMconv4_stage2_L1"
  top: "HandMconv4_stage2_L1"
}
layer {
  name: "HandMconv4_stage2_L2"
  type: "Convolution"
  bottom: "HandMconv3_stage2_L2"
  top: "HandMconv4_stage2_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu4_stage2_L2"
  type: "ReLU"
  bottom: "HandMconv4_stage2_L2"
  top: "HandMconv4_stage2_L2"
}
layer {
  name: "HandMconv5_stage2_L1"
  type: "Convolution"
  bottom: "HandMconv4_stage2_L1"
  top: "HandMconv5_stage2_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu5_stage2_L1"
  type: "ReLU"
  bottom: "HandMconv5_stage2_L1"
  top: "HandMconv5_stage2_L1"
}
layer {
  name: "HandMconv5_stage2_L2"
  type: "Convolution"
  bottom: "HandMconv4_stage2_L2"
  top: "HandMconv5_stage2_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu5_stage2_L2"
  type: "ReLU"
  bottom: "HandMconv5_stage2_L2"
  top: "HandMconv5_stage2_L2"
}
layer {
  name: "HandMconv6_stage2_L1"
  type: "Convolution"
  bottom: "HandMconv5_stage2_L1"
  top: "HandMconv6_stage2_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu6_stage2_L1"
  type: "ReLU"
  bottom: "HandMconv6_stage2_L1"
  top: "HandMconv6_stage2_L1"
}
layer {
  name: "HandMconv6_stage2_L2"
  type: "Convolution"
  bottom: "HandMconv5_stage2_L2"
  top: "HandMconv6_stage2_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu6_stage2_L2"
  type: "ReLU"
  bottom: "HandMconv6_stage2_L2"
  top: "HandMconv6_stage2_L2"
}
layer {
  name: "HandMconv7_stage2_L1"
  type: "Convolution"
  bottom: "HandMconv6_stage2_L1"
  top: "HandMconv7_stage2_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 40
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMconv7_stage2_L2"
  type: "Convolution"
  bottom: "HandMconv6_stage2_L2"
  top: "HandMconv7_stage2_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 22
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss_stage2_L1"
  type: "EuclideanLoss"
  bottom: "HandMconv7_stage2_L1"
  bottom: "label_vec"
  top: "loss_stage2_L1"
  loss_weight: 1
}
layer {
  name: "loss_stage2_L2"
  type: "EuclideanLoss"
  bottom: "HandMconv7_stage2_L2"
  bottom: "label_heat"
  top: "loss_stage2_L2"
  loss_weight: 1
}
layer {
  name: "concat_stage3"
  type: "Concat"
  bottom: "HandMconv7_stage2_L1"
  bottom: "HandMconv7_stage2_L2"
  bottom: "conv4_4_HandCPM"
  top: "concat_stage3"
  concat_param {
    axis: 1
  }
}
layer {
  name: "HandMconv1_stage3_L1"
  type: "Convolution"
  bottom: "concat_stage3"
  top: "HandMconv1_stage3_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu1_stage3_L1"
  type: "ReLU"
  bottom: "HandMconv1_stage3_L1"
  top: "HandMconv1_stage3_L1"
}
layer {
  name: "HandMconv1_stage3_L2"
  type: "Convolution"
  bottom: "concat_stage3"
  top: "HandMconv1_stage3_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu1_stage3_L2"
  type: "ReLU"
  bottom: "HandMconv1_stage3_L2"
  top: "HandMconv1_stage3_L2"
}
layer {
  name: "HandMconv2_stage3_L1"
  type: "Convolution"
  bottom: "HandMconv1_stage3_L1"
  top: "HandMconv2_stage3_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu2_stage3_L1"
  type: "ReLU"
  bottom: "HandMconv2_stage3_L1"
  top: "HandMconv2_stage3_L1"
}
layer {
  name: "HandMconv2_stage3_L2"
  type: "Convolution"
  bottom: "HandMconv1_stage3_L2"
  top: "HandMconv2_stage3_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu2_stage3_L2"
  type: "ReLU"
  bottom: "HandMconv2_stage3_L2"
  top: "HandMconv2_stage3_L2"
}
layer {
  name: "HandMconv3_stage3_L1"
  type: "Convolution"
  bottom: "HandMconv2_stage3_L1"
  top: "HandMconv3_stage3_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu3_stage3_L1"
  type: "ReLU"
  bottom: "HandMconv3_stage3_L1"
  top: "HandMconv3_stage3_L1"
}
layer {
  name: "HandMconv3_stage3_L2"
  type: "Convolution"
  bottom: "HandMconv2_stage3_L2"
  top: "HandMconv3_stage3_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu3_stage3_L2"
  type: "ReLU"
  bottom: "HandMconv3_stage3_L2"
  top: "HandMconv3_stage3_L2"
}
layer {
  name: "HandMconv4_stage3_L1"
  type: "Convolution"
  bottom: "HandMconv3_stage3_L1"
  top: "HandMconv4_stage3_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu4_stage3_L1"
  type: "ReLU"
  bottom: "HandMconv4_stage3_L1"
  top: "HandMconv4_stage3_L1"
}
layer {
  name: "HandMconv4_stage3_L2"
  type: "Convolution"
  bottom: "HandMconv3_stage3_L2"
  top: "HandMconv4_stage3_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu4_stage3_L2"
  type: "ReLU"
  bottom: "HandMconv4_stage3_L2"
  top: "HandMconv4_stage3_L2"
}
layer {
  name: "HandMconv5_stage3_L1"
  type: "Convolution"
  bottom: "HandMconv4_stage3_L1"
  top: "HandMconv5_stage3_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu5_stage3_L1"
  type: "ReLU"
  bottom: "HandMconv5_stage3_L1"
  top: "HandMconv5_stage3_L1"
}
layer {
  name: "HandMconv5_stage3_L2"
  type: "Convolution"
  bottom: "HandMconv4_stage3_L2"
  top: "HandMconv5_stage3_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu5_stage3_L2"
  type: "ReLU"
  bottom: "HandMconv5_stage3_L2"
  top: "HandMconv5_stage3_L2"
}
layer {
  name: "HandMconv6_stage3_L1"
  type: "Convolution"
  bottom: "HandMconv5_stage3_L1"
  top: "HandMconv6_stage3_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu6_stage3_L1"
  type: "ReLU"
  bottom: "HandMconv6_stage3_L1"
  top: "HandMconv6_stage3_L1"
}
layer {
  name: "HandMconv6_stage3_L2"
  type: "Convolution"
  bottom: "HandMconv5_stage3_L2"
  top: "HandMconv6_stage3_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu6_stage3_L2"
  type: "ReLU"
  bottom: "HandMconv6_stage3_L2"
  top: "HandMconv6_stage3_L2"
}
layer {
  name: "HandMconv7_stage3_L1"
  type: "Convolution"
  bottom: "HandMconv6_stage3_L1"
  top: "HandMconv7_stage3_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 40
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMconv7_stage3_L2"
  type: "Convolution"
  bottom: "HandMconv6_stage3_L2"
  top: "HandMconv7_stage3_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 22
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss_stage3_L1"
  type: "EuclideanLoss"
  bottom: "HandMconv7_stage3_L1"
  bottom: "label_vec"
  top: "loss_stage3_L1"
  loss_weight: 1
}
layer {
  name: "loss_stage3_L2"
  type: "EuclideanLoss"
  bottom: "HandMconv7_stage3_L2"
  bottom: "label_heat"
  top: "loss_stage3_L2"
  loss_weight: 1
}
layer {
  name: "concat_stage4"
  type: "Concat"
  bottom: "HandMconv7_stage3_L1"
  bottom: "HandMconv7_stage3_L2"
  bottom: "conv4_4_HandCPM"
  top: "concat_stage4"
  concat_param {
    axis: 1
  }
}
layer {
  name: "HandMconv1_stage4_L1"
  type: "Convolution"
  bottom: "concat_stage4"
  top: "HandMconv1_stage4_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu1_stage4_L1"
  type: "ReLU"
  bottom: "HandMconv1_stage4_L1"
  top: "HandMconv1_stage4_L1"
}
layer {
  name: "HandMconv1_stage4_L2"
  type: "Convolution"
  bottom: "concat_stage4"
  top: "HandMconv1_stage4_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu1_stage4_L2"
  type: "ReLU"
  bottom: "HandMconv1_stage4_L2"
  top: "HandMconv1_stage4_L2"
}
layer {
  name: "HandMconv2_stage4_L1"
  type: "Convolution"
  bottom: "HandMconv1_stage4_L1"
  top: "HandMconv2_stage4_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu2_stage4_L1"
  type: "ReLU"
  bottom: "HandMconv2_stage4_L1"
  top: "HandMconv2_stage4_L1"
}
layer {
  name: "HandMconv2_stage4_L2"
  type: "Convolution"
  bottom: "HandMconv1_stage4_L2"
  top: "HandMconv2_stage4_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu2_stage4_L2"
  type: "ReLU"
  bottom: "HandMconv2_stage4_L2"
  top: "HandMconv2_stage4_L2"
}
layer {
  name: "HandMconv3_stage4_L1"
  type: "Convolution"
  bottom: "HandMconv2_stage4_L1"
  top: "HandMconv3_stage4_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu3_stage4_L1"
  type: "ReLU"
  bottom: "HandMconv3_stage4_L1"
  top: "HandMconv3_stage4_L1"
}
layer {
  name: "HandMconv3_stage4_L2"
  type: "Convolution"
  bottom: "HandMconv2_stage4_L2"
  top: "HandMconv3_stage4_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu3_stage4_L2"
  type: "ReLU"
  bottom: "HandMconv3_stage4_L2"
  top: "HandMconv3_stage4_L2"
}
layer {
  name: "HandMconv4_stage4_L1"
  type: "Convolution"
  bottom: "HandMconv3_stage4_L1"
  top: "HandMconv4_stage4_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu4_stage4_L1"
  type: "ReLU"
  bottom: "HandMconv4_stage4_L1"
  top: "HandMconv4_stage4_L1"
}
layer {
  name: "HandMconv4_stage4_L2"
  type: "Convolution"
  bottom: "HandMconv3_stage4_L2"
  top: "HandMconv4_stage4_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu4_stage4_L2"
  type: "ReLU"
  bottom: "HandMconv4_stage4_L2"
  top: "HandMconv4_stage4_L2"
}
layer {
  name: "HandMconv5_stage4_L1"
  type: "Convolution"
  bottom: "HandMconv4_stage4_L1"
  top: "HandMconv5_stage4_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu5_stage4_L1"
  type: "ReLU"
  bottom: "HandMconv5_stage4_L1"
  top: "HandMconv5_stage4_L1"
}
layer {
  name: "HandMconv5_stage4_L2"
  type: "Convolution"
  bottom: "HandMconv4_stage4_L2"
  top: "HandMconv5_stage4_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 3
    kernel_size: 7
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu5_stage4_L2"
  type: "ReLU"
  bottom: "HandMconv5_stage4_L2"
  top: "HandMconv5_stage4_L2"
}
layer {
  name: "HandMconv6_stage4_L1"
  type: "Convolution"
  bottom: "HandMconv5_stage4_L1"
  top: "HandMconv6_stage4_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu6_stage4_L1"
  type: "ReLU"
  bottom: "HandMconv6_stage4_L1"
  top: "HandMconv6_stage4_L1"
}
layer {
  name: "HandMconv6_stage4_L2"
  type: "Convolution"
  bottom: "HandMconv5_stage4_L2"
  top: "HandMconv6_stage4_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMrelu6_stage4_L2"
  type: "ReLU"
  bottom: "HandMconv6_stage4_L2"
  top: "HandMconv6_stage4_L2"
}
layer {
  name: "HandMconv7_stage4_L1"
  type: "Convolution"
  bottom: "HandMconv6_stage4_L1"
  top: "HandMconv7_stage4_L1"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 40
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "HandMconv7_stage4_L2"
  type: "Convolution"
  bottom: "HandMconv6_stage4_L2"
  top: "HandMconv7_stage4_L2"
  param {
    lr_mult: 4.0
    decay_mult: 1
  }
  param {
    lr_mult: 8.0
    decay_mult: 0
  }
  convolution_param {
    num_output: 22
    pad: 0
    kernel_size: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "loss_stage4_L1"
  type: "EuclideanLoss"
  bottom: "HandMconv7_stage4_L1"
  bottom: "label_vec"
  top: "loss_stage4_L1"
  loss_weight: 1
}
layer {
  name: "loss_stage4_L2"
  type: "EuclideanLoss"
  bottom: "HandMconv7_stage4_L2"
  bottom: "label_heat"
  top: "loss_stage4_L2"
  loss_weight: 1
}
