layer {
  name: "data"
  type: "CPMHandData"
  top: "data"
  top: "label"
  data_param {
    source: "D:/dataset/Hand/TopRHD/TopRHD/lmdb"
    batch_size: 10
    backend: LMDB
  }
  cpm_hand_transform_param {
    stride: 4
    max_rotate_degree: 40
    crop_size_x: 256
    crop_size_y: 256
    scale_prob: 1
    scale_min: 0.5
    scale_max: 1.1
    center_perterb_max: 20
    num_parts: 62
    np_in_lmdb: 21
    hand_padding: 1.2
    do_aug: true
  }
}
layer {
  name: "label_vec"
  type: "Slice"
  bottom: "label"
  top: "label_vec"
  top: "label_heat"
  slice_param {
    slice_point: 40
    axis: 1
  }
}
layer {
  name: "image"
  type: "Slice"
  bottom: "data"
  top: "image"
  top: "center_map"
  slice_param {
    slice_point: 3
    axis: 1
  }
}
layer {
  name: "conv0"
  type: "Convolution"
  bottom: "image"
  top: "conv0"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "bn0"
  type: "BatchNorm"
  bottom: "conv0"
  top: "conv0"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "scale0"
  type: "Scale"
  bottom: "conv0"
  top: "conv0"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "relu0"
  type: "ReLU"
  bottom: "conv0"
  top: "conv0"
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "conv0"
  top: "res2a_branch1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res2a_branch1_bn"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res2a_branch1_scale"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "conv0"
  top: "res2a_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2a_branch2a_bn"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res2a_branch2a_scale"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res2a_branch2b_bn"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res2a_branch2b_scale"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res2a_branch2c_bn"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res2a_branch2c_scale"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
}
layer {
  name: "pool0"
  type: "Pooling"
  bottom: "res2a"
  top: "pool0"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "res3b0_branch2a"
  type: "Convolution"
  bottom: "pool0"
  top: "res3b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res3b0_branch2a"
  top: "res3b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res3b0_branch2a_scale"
  type: "Scale"
  bottom: "res3b0_branch2a"
  top: "res3b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b0_branch2a_relu"
  type: "ReLU"
  bottom: "res3b0_branch2a"
  top: "res3b0_branch2a"
}
layer {
  name: "res3b0_branch2b"
  type: "Convolution"
  bottom: "res3b0_branch2a"
  top: "res3b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res3b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res3b0_branch2b"
  top: "res3b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res3b0_branch2b_scale"
  type: "Scale"
  bottom: "res3b0_branch2b"
  top: "res3b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b0_branch2b_relu"
  type: "ReLU"
  bottom: "res3b0_branch2b"
  top: "res3b0_branch2b"
}
layer {
  name: "res3b0_branch2c"
  type: "Convolution"
  bottom: "res3b0_branch2b"
  top: "res3b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res3b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res3b0_branch2c"
  top: "res3b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res3b0_branch2c_scale"
  type: "Scale"
  bottom: "res3b0_branch2c"
  top: "res3b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res3b0"
  type: "Eltwise"
  bottom: "pool0"
  bottom: "res3b0_branch2c"
  top: "res3b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res3b0_relu"
  type: "ReLU"
  bottom: "res3b0"
  top: "res3b0"
}
layer {
  name: "res4b0_branch2a"
  type: "Convolution"
  bottom: "res3b0"
  top: "res4b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res4b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res4b0_branch2a"
  top: "res4b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res4b0_branch2a_scale"
  type: "Scale"
  bottom: "res4b0_branch2a"
  top: "res4b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b0_branch2a_relu"
  type: "ReLU"
  bottom: "res4b0_branch2a"
  top: "res4b0_branch2a"
}
layer {
  name: "res4b0_branch2b"
  type: "Convolution"
  bottom: "res4b0_branch2a"
  top: "res4b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res4b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res4b0_branch2b"
  top: "res4b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res4b0_branch2b_scale"
  type: "Scale"
  bottom: "res4b0_branch2b"
  top: "res4b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b0_branch2b_relu"
  type: "ReLU"
  bottom: "res4b0_branch2b"
  top: "res4b0_branch2b"
}
layer {
  name: "res4b0_branch2c"
  type: "Convolution"
  bottom: "res4b0_branch2b"
  top: "res4b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res4b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res4b0_branch2c"
  top: "res4b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res4b0_branch2c_scale"
  type: "Scale"
  bottom: "res4b0_branch2c"
  top: "res4b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res4b0"
  type: "Eltwise"
  bottom: "res3b0"
  bottom: "res4b0_branch2c"
  top: "res4b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res4b0_relu"
  type: "ReLU"
  bottom: "res4b0"
  top: "res4b0"
}
layer {
  name: "res5b0_branch2a"
  type: "Convolution"
  bottom: "res4b0"
  top: "res5b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res5b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res5b0_branch2a"
  top: "res5b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res5b0_branch2a_scale"
  type: "Scale"
  bottom: "res5b0_branch2a"
  top: "res5b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res5b0_branch2a_relu"
  type: "ReLU"
  bottom: "res5b0_branch2a"
  top: "res5b0_branch2a"
}
layer {
  name: "res5b0_branch2b"
  type: "Convolution"
  bottom: "res5b0_branch2a"
  top: "res5b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res5b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res5b0_branch2b"
  top: "res5b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res5b0_branch2b_scale"
  type: "Scale"
  bottom: "res5b0_branch2b"
  top: "res5b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res5b0_branch2b_relu"
  type: "ReLU"
  bottom: "res5b0_branch2b"
  top: "res5b0_branch2b"
}
layer {
  name: "res5b0_branch2c"
  type: "Convolution"
  bottom: "res5b0_branch2b"
  top: "res5b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res5b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res5b0_branch2c"
  top: "res5b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res5b0_branch2c_scale"
  type: "Scale"
  bottom: "res5b0_branch2c"
  top: "res5b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res5b0"
  type: "Eltwise"
  bottom: "res4b0"
  bottom: "res5b0_branch2c"
  top: "res5b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res5b0_relu"
  type: "ReLU"
  bottom: "res5b0"
  top: "res5b0"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "res4b0"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "res6b0_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res6b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res6b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res6b0_branch2a"
  top: "res6b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res6b0_branch2a_scale"
  type: "Scale"
  bottom: "res6b0_branch2a"
  top: "res6b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res6b0_branch2a_relu"
  type: "ReLU"
  bottom: "res6b0_branch2a"
  top: "res6b0_branch2a"
}
layer {
  name: "res6b0_branch2b"
  type: "Convolution"
  bottom: "res6b0_branch2a"
  top: "res6b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res6b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res6b0_branch2b"
  top: "res6b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res6b0_branch2b_scale"
  type: "Scale"
  bottom: "res6b0_branch2b"
  top: "res6b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res6b0_branch2b_relu"
  type: "ReLU"
  bottom: "res6b0_branch2b"
  top: "res6b0_branch2b"
}
layer {
  name: "res6b0_branch2c"
  type: "Convolution"
  bottom: "res6b0_branch2b"
  top: "res6b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res6b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res6b0_branch2c"
  top: "res6b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res6b0_branch2c_scale"
  type: "Scale"
  bottom: "res6b0_branch2c"
  top: "res6b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res6b0"
  type: "Eltwise"
  bottom: "pool1"
  bottom: "res6b0_branch2c"
  top: "res6b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res6b0_relu"
  type: "ReLU"
  bottom: "res6b0"
  top: "res6b0"
}
layer {
  name: "res7b0_branch2a"
  type: "Convolution"
  bottom: "res6b0"
  top: "res7b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res7b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res7b0_branch2a"
  top: "res7b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res7b0_branch2a_scale"
  type: "Scale"
  bottom: "res7b0_branch2a"
  top: "res7b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res7b0_branch2a_relu"
  type: "ReLU"
  bottom: "res7b0_branch2a"
  top: "res7b0_branch2a"
}
layer {
  name: "res7b0_branch2b"
  type: "Convolution"
  bottom: "res7b0_branch2a"
  top: "res7b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res7b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res7b0_branch2b"
  top: "res7b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res7b0_branch2b_scale"
  type: "Scale"
  bottom: "res7b0_branch2b"
  top: "res7b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res7b0_branch2b_relu"
  type: "ReLU"
  bottom: "res7b0_branch2b"
  top: "res7b0_branch2b"
}
layer {
  name: "res7b0_branch2c"
  type: "Convolution"
  bottom: "res7b0_branch2b"
  top: "res7b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res7b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res7b0_branch2c"
  top: "res7b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res7b0_branch2c_scale"
  type: "Scale"
  bottom: "res7b0_branch2c"
  top: "res7b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res7b0"
  type: "Eltwise"
  bottom: "res6b0"
  bottom: "res7b0_branch2c"
  top: "res7b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res7b0_relu"
  type: "ReLU"
  bottom: "res7b0"
  top: "res7b0"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "res6b0"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "res8b0_branch2a"
  type: "Convolution"
  bottom: "pool2"
  top: "res8b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res8b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res8b0_branch2a"
  top: "res8b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res8b0_branch2a_scale"
  type: "Scale"
  bottom: "res8b0_branch2a"
  top: "res8b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res8b0_branch2a_relu"
  type: "ReLU"
  bottom: "res8b0_branch2a"
  top: "res8b0_branch2a"
}
layer {
  name: "res8b0_branch2b"
  type: "Convolution"
  bottom: "res8b0_branch2a"
  top: "res8b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res8b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res8b0_branch2b"
  top: "res8b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res8b0_branch2b_scale"
  type: "Scale"
  bottom: "res8b0_branch2b"
  top: "res8b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res8b0_branch2b_relu"
  type: "ReLU"
  bottom: "res8b0_branch2b"
  top: "res8b0_branch2b"
}
layer {
  name: "res8b0_branch2c"
  type: "Convolution"
  bottom: "res8b0_branch2b"
  top: "res8b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res8b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res8b0_branch2c"
  top: "res8b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res8b0_branch2c_scale"
  type: "Scale"
  bottom: "res8b0_branch2c"
  top: "res8b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res8b0"
  type: "Eltwise"
  bottom: "pool2"
  bottom: "res8b0_branch2c"
  top: "res8b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res8b0_relu"
  type: "ReLU"
  bottom: "res8b0"
  top: "res8b0"
}
layer {
  name: "res9b0_branch2a"
  type: "Convolution"
  bottom: "res8b0"
  top: "res9b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res9b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res9b0_branch2a"
  top: "res9b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res9b0_branch2a_scale"
  type: "Scale"
  bottom: "res9b0_branch2a"
  top: "res9b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res9b0_branch2a_relu"
  type: "ReLU"
  bottom: "res9b0_branch2a"
  top: "res9b0_branch2a"
}
layer {
  name: "res9b0_branch2b"
  type: "Convolution"
  bottom: "res9b0_branch2a"
  top: "res9b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res9b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res9b0_branch2b"
  top: "res9b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res9b0_branch2b_scale"
  type: "Scale"
  bottom: "res9b0_branch2b"
  top: "res9b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res9b0_branch2b_relu"
  type: "ReLU"
  bottom: "res9b0_branch2b"
  top: "res9b0_branch2b"
}
layer {
  name: "res9b0_branch2c"
  type: "Convolution"
  bottom: "res9b0_branch2b"
  top: "res9b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res9b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res9b0_branch2c"
  top: "res9b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res9b0_branch2c_scale"
  type: "Scale"
  bottom: "res9b0_branch2c"
  top: "res9b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res9b0"
  type: "Eltwise"
  bottom: "res8b0"
  bottom: "res9b0_branch2c"
  top: "res9b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res9b0_relu"
  type: "ReLU"
  bottom: "res9b0"
  top: "res9b0"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "res8b0"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "res10b0_branch2a"
  type: "Convolution"
  bottom: "pool3"
  top: "res10b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res10b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res10b0_branch2a"
  top: "res10b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res10b0_branch2a_scale"
  type: "Scale"
  bottom: "res10b0_branch2a"
  top: "res10b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res10b0_branch2a_relu"
  type: "ReLU"
  bottom: "res10b0_branch2a"
  top: "res10b0_branch2a"
}
layer {
  name: "res10b0_branch2b"
  type: "Convolution"
  bottom: "res10b0_branch2a"
  top: "res10b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res10b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res10b0_branch2b"
  top: "res10b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res10b0_branch2b_scale"
  type: "Scale"
  bottom: "res10b0_branch2b"
  top: "res10b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res10b0_branch2b_relu"
  type: "ReLU"
  bottom: "res10b0_branch2b"
  top: "res10b0_branch2b"
}
layer {
  name: "res10b0_branch2c"
  type: "Convolution"
  bottom: "res10b0_branch2b"
  top: "res10b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res10b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res10b0_branch2c"
  top: "res10b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res10b0_branch2c_scale"
  type: "Scale"
  bottom: "res10b0_branch2c"
  top: "res10b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res10b0"
  type: "Eltwise"
  bottom: "pool3"
  bottom: "res10b0_branch2c"
  top: "res10b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res10b0_relu"
  type: "ReLU"
  bottom: "res10b0"
  top: "res10b0"
}
layer {
  name: "res11b0_branch2a"
  type: "Convolution"
  bottom: "res10b0"
  top: "res11b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res11b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res11b0_branch2a"
  top: "res11b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res11b0_branch2a_scale"
  type: "Scale"
  bottom: "res11b0_branch2a"
  top: "res11b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res11b0_branch2a_relu"
  type: "ReLU"
  bottom: "res11b0_branch2a"
  top: "res11b0_branch2a"
}
layer {
  name: "res11b0_branch2b"
  type: "Convolution"
  bottom: "res11b0_branch2a"
  top: "res11b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res11b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res11b0_branch2b"
  top: "res11b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res11b0_branch2b_scale"
  type: "Scale"
  bottom: "res11b0_branch2b"
  top: "res11b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res11b0_branch2b_relu"
  type: "ReLU"
  bottom: "res11b0_branch2b"
  top: "res11b0_branch2b"
}
layer {
  name: "res11b0_branch2c"
  type: "Convolution"
  bottom: "res11b0_branch2b"
  top: "res11b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res11b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res11b0_branch2c"
  top: "res11b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res11b0_branch2c_scale"
  type: "Scale"
  bottom: "res11b0_branch2c"
  top: "res11b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res11b0"
  type: "Eltwise"
  bottom: "res10b0"
  bottom: "res11b0_branch2c"
  top: "res11b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res11b0_relu"
  type: "ReLU"
  bottom: "res11b0"
  top: "res11b0"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "res10b0"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "res12b0_branch2a"
  type: "Convolution"
  bottom: "pool4"
  top: "res12b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res12b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res12b0_branch2a"
  top: "res12b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res12b0_branch2a_scale"
  type: "Scale"
  bottom: "res12b0_branch2a"
  top: "res12b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res12b0_branch2a_relu"
  type: "ReLU"
  bottom: "res12b0_branch2a"
  top: "res12b0_branch2a"
}
layer {
  name: "res12b0_branch2b"
  type: "Convolution"
  bottom: "res12b0_branch2a"
  top: "res12b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res12b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res12b0_branch2b"
  top: "res12b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res12b0_branch2b_scale"
  type: "Scale"
  bottom: "res12b0_branch2b"
  top: "res12b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res12b0_branch2b_relu"
  type: "ReLU"
  bottom: "res12b0_branch2b"
  top: "res12b0_branch2b"
}
layer {
  name: "res12b0_branch2c"
  type: "Convolution"
  bottom: "res12b0_branch2b"
  top: "res12b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res12b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res12b0_branch2c"
  top: "res12b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res12b0_branch2c_scale"
  type: "Scale"
  bottom: "res12b0_branch2c"
  top: "res12b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res12b0"
  type: "Eltwise"
  bottom: "pool4"
  bottom: "res12b0_branch2c"
  top: "res12b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res12b0_relu"
  type: "ReLU"
  bottom: "res12b0"
  top: "res12b0"
}
layer {
  name: "res13b0_branch2a"
  type: "Convolution"
  bottom: "res12b0"
  top: "res13b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res13b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res13b0_branch2a"
  top: "res13b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res13b0_branch2a_scale"
  type: "Scale"
  bottom: "res13b0_branch2a"
  top: "res13b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res13b0_branch2a_relu"
  type: "ReLU"
  bottom: "res13b0_branch2a"
  top: "res13b0_branch2a"
}
layer {
  name: "res13b0_branch2b"
  type: "Convolution"
  bottom: "res13b0_branch2a"
  top: "res13b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res13b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res13b0_branch2b"
  top: "res13b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res13b0_branch2b_scale"
  type: "Scale"
  bottom: "res13b0_branch2b"
  top: "res13b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res13b0_branch2b_relu"
  type: "ReLU"
  bottom: "res13b0_branch2b"
  top: "res13b0_branch2b"
}
layer {
  name: "res13b0_branch2c"
  type: "Convolution"
  bottom: "res13b0_branch2b"
  top: "res13b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res13b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res13b0_branch2c"
  top: "res13b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res13b0_branch2c_scale"
  type: "Scale"
  bottom: "res13b0_branch2c"
  top: "res13b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res13b0"
  type: "Eltwise"
  bottom: "res12b0"
  bottom: "res13b0_branch2c"
  top: "res13b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res13b0_relu"
  type: "ReLU"
  bottom: "res13b0"
  top: "res13b0"
}
layer {
  name: "res14b0_branch2a"
  type: "Convolution"
  bottom: "res13b0"
  top: "res14b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res14b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res14b0_branch2a"
  top: "res14b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res14b0_branch2a_scale"
  type: "Scale"
  bottom: "res14b0_branch2a"
  top: "res14b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res14b0_branch2a_relu"
  type: "ReLU"
  bottom: "res14b0_branch2a"
  top: "res14b0_branch2a"
}
layer {
  name: "res14b0_branch2b"
  type: "Convolution"
  bottom: "res14b0_branch2a"
  top: "res14b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res14b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res14b0_branch2b"
  top: "res14b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res14b0_branch2b_scale"
  type: "Scale"
  bottom: "res14b0_branch2b"
  top: "res14b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res14b0_branch2b_relu"
  type: "ReLU"
  bottom: "res14b0_branch2b"
  top: "res14b0_branch2b"
}
layer {
  name: "res14b0_branch2c"
  type: "Convolution"
  bottom: "res14b0_branch2b"
  top: "res14b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res14b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res14b0_branch2c"
  top: "res14b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res14b0_branch2c_scale"
  type: "Scale"
  bottom: "res14b0_branch2c"
  top: "res14b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res14b0"
  type: "Eltwise"
  bottom: "res13b0"
  bottom: "res14b0_branch2c"
  top: "res14b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res14b0_relu"
  type: "ReLU"
  bottom: "res14b0"
  top: "res14b0"
}
layer {
  name: "deconv0"
  type: "Deconvolution"
  bottom: "res14b0"
  top: "deconv0"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "add0"
  type: "Eltwise"
  bottom: "res11b0"
  bottom: "deconv0"
  top: "add0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res15b0_branch2a"
  type: "Convolution"
  bottom: "add0"
  top: "res15b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res15b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res15b0_branch2a"
  top: "res15b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res15b0_branch2a_scale"
  type: "Scale"
  bottom: "res15b0_branch2a"
  top: "res15b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res15b0_branch2a_relu"
  type: "ReLU"
  bottom: "res15b0_branch2a"
  top: "res15b0_branch2a"
}
layer {
  name: "res15b0_branch2b"
  type: "Convolution"
  bottom: "res15b0_branch2a"
  top: "res15b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res15b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res15b0_branch2b"
  top: "res15b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res15b0_branch2b_scale"
  type: "Scale"
  bottom: "res15b0_branch2b"
  top: "res15b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res15b0_branch2b_relu"
  type: "ReLU"
  bottom: "res15b0_branch2b"
  top: "res15b0_branch2b"
}
layer {
  name: "res15b0_branch2c"
  type: "Convolution"
  bottom: "res15b0_branch2b"
  top: "res15b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res15b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res15b0_branch2c"
  top: "res15b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res15b0_branch2c_scale"
  type: "Scale"
  bottom: "res15b0_branch2c"
  top: "res15b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res15b0"
  type: "Eltwise"
  bottom: "add0"
  bottom: "res15b0_branch2c"
  top: "res15b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res15b0_relu"
  type: "ReLU"
  bottom: "res15b0"
  top: "res15b0"
}
layer {
  name: "deconv1"
  type: "Deconvolution"
  bottom: "res15b0"
  top: "deconv1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "add1"
  type: "Eltwise"
  bottom: "res9b0"
  bottom: "deconv1"
  top: "add1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res16b0_branch2a"
  type: "Convolution"
  bottom: "add1"
  top: "res16b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res16b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res16b0_branch2a"
  top: "res16b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res16b0_branch2a_scale"
  type: "Scale"
  bottom: "res16b0_branch2a"
  top: "res16b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res16b0_branch2a_relu"
  type: "ReLU"
  bottom: "res16b0_branch2a"
  top: "res16b0_branch2a"
}
layer {
  name: "res16b0_branch2b"
  type: "Convolution"
  bottom: "res16b0_branch2a"
  top: "res16b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res16b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res16b0_branch2b"
  top: "res16b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res16b0_branch2b_scale"
  type: "Scale"
  bottom: "res16b0_branch2b"
  top: "res16b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res16b0_branch2b_relu"
  type: "ReLU"
  bottom: "res16b0_branch2b"
  top: "res16b0_branch2b"
}
layer {
  name: "res16b0_branch2c"
  type: "Convolution"
  bottom: "res16b0_branch2b"
  top: "res16b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res16b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res16b0_branch2c"
  top: "res16b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res16b0_branch2c_scale"
  type: "Scale"
  bottom: "res16b0_branch2c"
  top: "res16b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res16b0"
  type: "Eltwise"
  bottom: "add1"
  bottom: "res16b0_branch2c"
  top: "res16b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res16b0_relu"
  type: "ReLU"
  bottom: "res16b0"
  top: "res16b0"
}
layer {
  name: "deconv2"
  type: "Deconvolution"
  bottom: "res16b0"
  top: "deconv2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "add2"
  type: "Eltwise"
  bottom: "res7b0"
  bottom: "deconv2"
  top: "add2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res17b0_branch2a"
  type: "Convolution"
  bottom: "add2"
  top: "res17b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res17b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res17b0_branch2a"
  top: "res17b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res17b0_branch2a_scale"
  type: "Scale"
  bottom: "res17b0_branch2a"
  top: "res17b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res17b0_branch2a_relu"
  type: "ReLU"
  bottom: "res17b0_branch2a"
  top: "res17b0_branch2a"
}
layer {
  name: "res17b0_branch2b"
  type: "Convolution"
  bottom: "res17b0_branch2a"
  top: "res17b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res17b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res17b0_branch2b"
  top: "res17b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res17b0_branch2b_scale"
  type: "Scale"
  bottom: "res17b0_branch2b"
  top: "res17b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res17b0_branch2b_relu"
  type: "ReLU"
  bottom: "res17b0_branch2b"
  top: "res17b0_branch2b"
}
layer {
  name: "res17b0_branch2c"
  type: "Convolution"
  bottom: "res17b0_branch2b"
  top: "res17b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res17b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res17b0_branch2c"
  top: "res17b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res17b0_branch2c_scale"
  type: "Scale"
  bottom: "res17b0_branch2c"
  top: "res17b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res17b0"
  type: "Eltwise"
  bottom: "add2"
  bottom: "res17b0_branch2c"
  top: "res17b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res17b0_relu"
  type: "ReLU"
  bottom: "res17b0"
  top: "res17b0"
}
layer {
  name: "deconv3"
  type: "Deconvolution"
  bottom: "res17b0"
  top: "deconv3"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 4
    stride: 2
    weight_filler {
      type: "bilinear"
    }
  }
}
layer {
  name: "add3"
  type: "Eltwise"
  bottom: "res5b0"
  bottom: "deconv3"
  top: "add3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res18b0_branch2a"
  type: "Convolution"
  bottom: "add3"
  top: "res18b0_branch2a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res18b0_branch2a_bn"
  type: "BatchNorm"
  bottom: "res18b0_branch2a"
  top: "res18b0_branch2a"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res18b0_branch2a_scale"
  type: "Scale"
  bottom: "res18b0_branch2a"
  top: "res18b0_branch2a"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res18b0_branch2a_relu"
  type: "ReLU"
  bottom: "res18b0_branch2a"
  top: "res18b0_branch2a"
}
layer {
  name: "res18b0_branch2b"
  type: "Convolution"
  bottom: "res18b0_branch2a"
  top: "res18b0_branch2b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "res18b0_branch2b_bn"
  type: "BatchNorm"
  bottom: "res18b0_branch2b"
  top: "res18b0_branch2b"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res18b0_branch2b_scale"
  type: "Scale"
  bottom: "res18b0_branch2b"
  top: "res18b0_branch2b"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res18b0_branch2b_relu"
  type: "ReLU"
  bottom: "res18b0_branch2b"
  top: "res18b0_branch2b"
}
layer {
  name: "res18b0_branch2c"
  type: "Convolution"
  bottom: "res18b0_branch2b"
  top: "res18b0_branch2c"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "res18b0_branch2c_bn"
  type: "BatchNorm"
  bottom: "res18b0_branch2c"
  top: "res18b0_branch2c"
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "res18b0_branch2c_scale"
  type: "Scale"
  bottom: "res18b0_branch2c"
  top: "res18b0_branch2c"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res18b0"
  type: "Eltwise"
  bottom: "add3"
  bottom: "res18b0_branch2c"
  top: "res18b0"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "res18b0_relu"
  type: "ReLU"
  bottom: "res18b0"
  top: "res18b0"
}
layer {
